src/main/java/com/cognitive/zadatak/services/request1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cus="http://www.example.org/CustomerInformation/">
    <soapenv:Header/>
    <soapenv:Body>
        <cus:getCustomerDetails>
            <getCustomerDetails>
                <id>?</id>
            </getCustomerDetails>
        </cus:getCustomerDetails>
    </soapenv:Body>
</soapenv:Envelope>